NEW_USER_GREETING = """
🚀 <b>Добро пожаловать, {}!</b>

Я ваш помощник для отслеживания и поиска задач на <b>Codeforces</b>. 📊

Чтобы начать, введите команду: 
👉 <b>/tasks</b>

💡 Удачи и приятного кодинга! 💻
"""

TAG_RATING_MESSAGE_KEYBOARD = """
🎯 <b>Выберите тему</b> и <b>уровень сложности задачи</b>:

📚 <i>Темы:</i> Алгоритмы, Структуры данных, Математика и другие.
🔢 <i>Сложности:</i> 800, 1000, 1300 и другие.

👇 <b>Выберите параметры из списка ниже:</b>
"""

EXIT_MESSAGE = """
🔄 <b>Хотите начать заново?</b>

Введите команду: 
👉 <b>/tasks</b>
"""

TASK_MESSAGE_KEYBOARD = """
📜 <b>Список задач</b>

📝 <i>Выберите задачу, которая вам интересна, из предложенного списка.</i>
👇 <b>Кликните на задачу:</b>
"""

TASK_INFO = """
📑 <b>Информация о задаче</b>

<b>🔸 Название:</b> {}
<b>🔹 Рейтинг:</b> {}
<b>🔸 Решено:</b> {}
<b>🔹 Ссылка:</b> <a href="{}">🔗 Codeforces</a>
"""
